### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.container_apps.module.backend_func_itn.azapi_resource.this[0] will be updated in-place
  ~ resource "azapi_resource" "this" {
      ~ body                      = {
          ~ properties = {
              ~ template      = {
                  ~ containers                    = [
                      ~ {
                            name      = "appbackend"
                          ~ probes    = [
                              ~ {
                                  ~ failureThreshold    = 3 -> 10
                                  ~ tcpSocket           = {
                                      - port = 80
                                    } -> null
                                    # (4 unchanged attributes hidden)
                                },
                              ~ {
                                  ~ failureThreshold    = 10 -> 3
                                  ~ httpGet             = {
                                      - httpHeaders = null
                                      - path        = "/api/v1/info"
                                      - port        = 80
                                      - scheme      = "HTTP"
                                    } -> null
                                    # (3 unchanged attributes hidden)
                                },
                            ]
                            # (3 unchanged attributes hidden)
                        },
                    ]
                    # (2 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.App/containerApps/io-p-itn-svc-app-be-func-02"
        name                      = "io-p-itn-svc-app-be-func-02"
      ~ output                    = {
          - properties = {
              - configuration = {
                  - ingress = {
                      - fqdn = "io-p-itn-svc-app-be-func-02.ambitioussea-e5d71305.italynorth.azurecontainerapps.io"
                    }
                }
            }
        } -> (known after apply)
        tags                      = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.backoffice.module.bo_roles.module.apim.azurerm_role_assignment.this["io-p-itn-common-rg-01|io-p-itn-apim-01|owner"] will be created
  + resource "azurerm_role_assignment" "this" {
      + condition_version                = (known after apply)
      + description                      = "To allow interaction with APIM"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b47338ad-dd98-43c1-8d2f-1cd9756ac25f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "API Management Service Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.backoffice.module.bo_roles.module.apim.azurerm_role_assignment.this["io-p-itn-common-rg-01|io-p-itn-apim-01|reader"] will be destroyed
  # (because key ["io-p-itn-common-rg-01|io-p-itn-apim-01|reader"] is not in for_each map)
  - resource "azurerm_role_assignment" "this" {
      - description                            = "To allow interaction with APIM" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/providers/Microsoft.Authorization/roleAssignments/6db4fedf-5f0a-5dc0-1de6-23a1e29f6110" -> null
      - name                                   = "6db4fedf-5f0a-5dc0-1de6-23a1e29f6110" -> null
      - principal_id                           = "b47338ad-dd98-43c1-8d2f-1cd9756ac25f" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/71522526-b88f-4d52-b57f-d31fc3546d0d" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01" -> null
        # (3 unchanged attributes hidden)
    }

  # module.backoffice.module.bo_staging_slot_roles.module.apim.azurerm_role_assignment.this["io-p-itn-common-rg-01|io-p-itn-apim-01|owner"] will be created
  + resource "azurerm_role_assignment" "this" {
      + condition_version                = (known after apply)
      + description                      = "To allow interaction with APIM"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "913739e7-6fe3-47fe-8eba-06416fbdb3ed"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "API Management Service Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.backoffice.module.bo_staging_slot_roles.module.apim.azurerm_role_assignment.this["io-p-itn-common-rg-01|io-p-itn-apim-01|reader"] will be destroyed
  # (because key ["io-p-itn-common-rg-01|io-p-itn-apim-01|reader"] is not in for_each map)
  - resource "azurerm_role_assignment" "this" {
      - description                            = "To allow interaction with APIM" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/providers/Microsoft.Authorization/roleAssignments/be15f27c-33c2-afca-2de0-a0c9487dfafb" -> null
      - name                                   = "be15f27c-33c2-afca-2de0-a0c9487dfafb" -> null
      - principal_id                           = "913739e7-6fe3-47fe-8eba-06416fbdb3ed" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/71522526-b88f-4d52-b57f-d31fc3546d0d" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01" -> null
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/cms_function_app.cms_storage_account/cmk.tf line 18, in resource "azurerm_key_vault_access_policy" "keys":
  18:   for_each     = (local.cmk_flags.kv && try(local.cmk_info.kv.same_subscription, false) && try(data.azurerm_key_vault.this["kv"].enable_rbac_authorization, false) == false ? toset(["kv"]) : toset([]))

The attribute "enable_rbac_authorization" is deprecated. Refer to the
provider documentation for details.

(and 7 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-review-legacy"],
  on .terraform/modules/cms_function_app.cms_storage_account/storage_account.tf line 139, in resource "azurerm_storage_queue" "this":
 139:   storage_account_name = azurerm_storage_account.this.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 27 more similar warnings elsewhere)
```

</details>
